Classes | Functions
Design Options
Functions related to the Design Options, Design Option Combinations, and Design Option - View connection. More...
 Classes
class  | ACAPI::v1::DesignOptionCombination
A class that represents the design option combination of the view settings. More...
class  | ACAPI::v1::DesignOptionCombinationViewSettings
A class that represents the design option combination settings of a view. More...
struct  | ACAPI::v1::DesignOptionCombinationViewSettings::MainModelOnly
A type of combination that has no design option connected to it, and only shows the main model. More...
struct  | ACAPI::v1::DesignOptionCombinationViewSettings::Standard
A type of combination for which the user has selected a specific set of design options. More...
struct  | ACAPI::v1::DesignOptionCombinationViewSettings::Custom
A type of combination that the user has modified, but did not give an explicit name. More...
struct  | ACAPI::v1::DesignOptionCombinationViewSettings::Missing
A type of combination that does not exist, and was previously deleted. More...
class  | ACAPI::v1::DesignOptionManager
A class that contains design option related functions. More...
 Functions
DesignOptionManager  | ACAPI::CreateDesignOptionManager ()
A function to create design option manager instance, that lets you query and manipulate design option related data.
Result< DesignOptionManager >  | ACAPI::v2::CreateDesignOptionManager ()
A function to create design option manager instance, that lets you query and manipulate design option related data.
Detailed Description
Functions related to the Design Options, Design Option Combinations, and Design Option - View connection.
Function Documentation
◆ CreateDesignOptionManager() [1/2]
 DesignOptionManager ACAPI::v1::CreateDesignOptionManager  |  ( |   | )
inline
A function to create design option manager instance, that lets you query and manipulate design option related data.
Returns
The design option manager instance.
Warning
Kept for compatibility reasons. Do not use!
◆ CreateDesignOptionManager() [2/2]
 Result< DesignOptionManager > ACAPI::v2::CreateDesignOptionManager  |  ( |   | )
inline
A function to create design option manager instance, that lets you query and manipulate design option related data.
Returns
The design option manager instance.